- ## ***Задача***

***Написать программу, которая из имеющегося массива строк формирует массив из строк, 
длина которых меньше либо равна 3 символа.
Первоначальный массив можно ввести с клавиатуры, 
либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями,
 лучше обойтись
исключительно массивами.
Примеры:
c -> ["2", ":-)"]
['1234", "1567", "-2", "computer science"] -> ["-2"]
["Russia", "Denmark", "Kazan"] -> [] -***

-----------------------

1. Для начала вводим от руки массив из строк, с определенным количеством символов.
2. Создаем **метод** , печатающий наш массив в консоль.

void printArray(string[] array)
{

    for(int i=0;i<array.Length;i++)

    {
        Console.WriteLine($"{array[i]}  ");
    }
}

3. Создаем еще один __метод__, который будет возвращать нам уже новый массив, в котором длина элементов меньше 3.
4. В этом методе будет 2 действия, проверка длины строк каждого элемента первоначального массива и подсчет количества элементов "j". И создание нового массива, длина которого будет "j", и заполнение его с помощью проверки первоначального массива 

string[] newArrayS(string[] array)
{

    int j =0;
    for(int i=0;i<array.Length;i++)
    {
        if(array[i].Length <= 3)
        {
            j++;
        }
    }
    string[] newArraySimbols = new string[j];
    j=0;
    for(int i =0;i<array.Length;i++)
    {
        if(array[i].Length <=3)
        {
            newArraySimbols[j] = array[i];
            j++;
        }
    }
    return newArraySimbols;
    }

5. Возвращаем новый массив и печаатем его с помощью метода.

## **ЗАДАЧА РЕШЕНА**